Repository: ChrisLauinger77/Penguin-AI-Chatbot-for-GNOME
Catalog: po/*.po
Languages: de

source: Chat with me
de: Chatte mit mir

source: I am thinking...
de: Ich denke nach...

source: Create a new conversation (Deletes current)
de: Neue Konversation erstellen (Löscht die aktuelle)

source: Click on text to copy
de: Klicken Sie auf Text zum Kopieren

source: Loading history...
de: Lade Verlauf...

source: Hmm, an error occurred when trying to reach out to the assistant. Check your API key and model settings for {0} and try again. It could also be your internet connection!
de: Hmm, ein Fehler ist aufgetreten beim Versuch, den Assistenten zu erreichen. Überprüfen Sie Ihren API-Schlüssel und die Modelleinstellungen für {0} und versuchen Sie es erneut. Es könnte auch an Ihrer Internetverbindung liegen!

source: We are having trouble getting a response from the assistant. Here is the error - if it helps at all: {0} Some tips: - Check your internet connection - If you recently changed your provider, try deleting your history.
de: Wir haben Probleme, eine Antwort vom Assistenten zu erhalten. Hier ist der Fehler - falls das überhaupt hilft: {0} Ein paar Tipps: - Überprüfen Sie Ihre Internetverbindung - Wenn Sie kürzlich Ihren Anbieter gewechselt haben, versuchen Sie, Ihren Verlauf zu löschen.

source: Click here to go to settings
de: Klicken Sie hier, um zu den Einstellungen zu gelangen

source: Preferences Saved
de: Einstellungen gespeichert

source: Save Preferences
de: Einstellungen speichern

source: Click 'Save Preferences' to apply your changes.
de: Klicken Sie auf 'Einstellungen speichern', um Ihre Änderungen anzuwenden.

source: Choose LLM Provider:
de: LLM-Anbieter wählen:

source: Select the Large Language Model (LLM) provider you want to use.
de: Wählen Sie den Large Language Model (LLM) Anbieter aus, den Sie verwenden möchten.

source: Anthropic API Key:
de: Anthropic API-Schlüssel:

source: Enter your Anthropic API key here.
de: Geben Sie hier Ihren Anthropic API-Schlüssel ein.

source: Get Anthropic API Key
de: Anthropic API-Schlüssel erhalten

source: OpenAI API Key:
de: OpenAI API-Schlüssel:

source: Enter your OpenAI API key here.
de: Geben Sie hier Ihren OpenAI API-Schlüssel ein.

source: Get OpenAI API Key
de: OpenAI API-Schlüssel erhalten

source: Gemini API Key:
de: Gemini API-Schlüssel:

source: Enter your Gemini API key here.
de: Geben Sie hier Ihren Gemini API-Schlüssel ein.

source: Get Gemini API Key
de: Gemini API-Schlüssel erhalten

source: OpenRouter API Key:
de: OpenRouter API-Schlüssel:

source: Enter your OpenRouter API key here.
de: Geben Sie hier Ihren OpenRouter API-Schlüssel ein.

source: Get OpenRouter API Key
de: OpenRouter API-Schlüssel erhalten

source: Anthropic Model:
de: Anthropic-Modell:

source: Specify the Anthropic model you want to use. Example: claude-v1.3
de: Geben Sie das Anthropic-Modell an, das Sie verwenden möchten. Beispiel: claude-v1.3

source: Available Anthropic Models
de: Verfügbare Anthropic-Modelle

source: OpenAI Model:
de: OpenAI-Modell:

source: Specify the OpenAI model you want to use. Example: gpt-3.5-turbo
de: Geben Sie das OpenAI-Modell an, das Sie verwenden möchten. Beispiel: gpt-3.5-turbo

source: Available OpenAI Models
de: Verfügbare OpenAI-Modelle

source: Gemini Model:
de: Gemini-Modell:

source: Specify the Gemini model you want to use. Example: gemini-1.0-pro
de: Geben Sie das Gemini-Modell an, das Sie verwenden möchten. Beispiel: gemini-1.0-pro

source: Available Gemini Models
de: Verfügbare Gemini-Modelle

source: OpenRouter Model:
de: OpenRouter-Modell:

source: Specify the OpenRouter model you want to use. Example: meta-llama/llama-3.3-70b-instruct:free
de: Geben Sie das OpenRouter-Modell an, das Sie verwenden möchten. Beispiel: meta-llama/llama-3.3-70b-instruct:free

source: Available OpenRouter Models
de: Verfügbare OpenRouter-Modelle

source: Your Message Background Color:
de: Hintergrundfarbe Ihrer Nachrichten:

source: Select the background color for your messages.
de: Wählen Sie die Hintergrundfarbe für Ihre Nachrichten.

source: Your Message Text Color:
de: Textfarbe Ihrer Nachrichten:

source: Select the text color for your messages.
de: Wählen Sie die Textfarbe für Ihre Nachrichten.

source: Chatbot Message Background Color:
de: Hintergrundfarbe der Chatbot-Nachrichten:

source: Select the background color for the chatbot's messages.
de: Wählen Sie die Hintergrundfarbe für die Nachrichten des Chatbots.

source: Chatbot Message Text Color:
de: Textfarbe der Chatbot-Nachrichten:

source: Select the text color for the chatbot's messages.
de: Wählen Sie die Textfarbe für die Nachrichten des Chatbots.

source: URL of the local tool server for function calling (weather, search, system info).
de: URL des lokalen Tool-Servers für Funktionsaufrufe (Wetter, Suche, Systeminformationen).

source: Weather Latitude:
de: Wetterstandort Breitengrad:

source: Latitude coordinate for weather queries.
de: Breitengrad-Koordinate für Wetterabfragen.

source: Weather Longitude:
de: Wetterstandort Längengrad:

source: Longitude coordinate for weather queries.
de: Längengrad-Koordinate für Wetterabfragen.

source: Open Chat Shortcut:
de: Chat-Fenster öffnen Tastenkombination:

source: Click on the row to set a keyboard shortcut for opening the chat window.
de: Klicken Sie auf die Zeile, um eine Tastenkombination zum Öffnen des Chat-Fensters festzulegen.

source: Set the keyboard shortcut to open the chat window.
de: Legen Sie die Tastenkombination zum Öffnen des Chat-Fensters fest.

source: New shortcut
de: Neues Tastenkürzel

source: Settings:
de: Einstellungen:

source: Shortcut:
de: Tastenkürzel:

source: Colors:
de: Farben:

source: LLM Provider
de: LLM-Anbieter

source: Choose the Large Language Model (LLM) provider for the chatbot.
de: Wählen Sie den Large Language Model (LLM) Anbieter für den Chatbot.

source: Anthropic API Key
de: Anthropic API-Schlüssel

source: Your Anthropic API key. Required to use Anthropic models.
de: Ihr Anthropic API-Schlüssel. Erforderlich, um Anthropic-Modelle zu verwenden.

source: OpenAI API Key
de: OpenAI API-Schlüssel

source: Your OpenAI API key. Required to use OpenAI models.
de: Ihr OpenAI API-Schlüssel. Erforderlich, um OpenAI-Modelle zu verwenden.

source: Gemini API Key
de: Gemini API-Schlüssel

source: Your Gemini API key. Required to use Gemini models.
de: Ihr Gemini API-Schlüssel. Erforderlich, um Gemini-Modelle zu verwenden.

source: Open Router API Key
de: OpenRouter API-Schlüssel

source: Your Open Router API key. Required to use Open Router models.
de: Ihr OpenRouter API-Schlüssel. Erforderlich, um OpenRouter-Modelle zu verwenden.

source: Anthropic Model
de: Anthropic-Modell

source: The Anthropic model to use for chat.
de: Das zu verwendende Anthropic-Modell für den Chat.

source: OpenAI Model
de: OpenAI-Modell

source: The OpenAI model to use for chat.
de: Das zu verwendende OpenAI-Modell für den Chat.

source: OpenRouter model
de: OpenRouter-Modell

source: The OpenRouter model to use for chat.
de: Das zu verwendende OpenRouter-Modell für den Chat.

source: Gemini Model
de: Gemini-Modell

source: The Gemini model to use for chat.
de: Das zu verwendende Gemini-Modell für den Chat.

source: Chat History
de: Chat-Verlauf

source: Stores the chat history as a JSON string.
de: Speichert den Chat-Verlauf als JSON-String.

source: Your Message Background Color
de: Hintergrundfarbe Ihrer Nachrichten

source: The background color for your messages.
de: Die Hintergrundfarbe für Ihre Nachrichten.

source: Chatbot Message Background Color
de: Hintergrundfarbe der Chatbot-Nachrichten

source: The background color for the chatbot's messages.
de: Die Hintergrundfarbe für die Nachrichten des Chatbots.

source: Chatbot Message Text Color
de: Textfarbe der Chatbot-Nachrichten

source: The text color for the chatbot's messages.
de: Die Textfarbe für die Nachrichten des Chatbots.

source: Your Message Text Color
de: Textfarbe Ihrer Nachrichten

source: The text color for your messages.
de: Die Textfarbe für Ihre Nachrichten.

source: Shortcut to open the chat window
de: Tastenkombination zum Öffnen des Chat-Fensters

source: Keyboard shortcut to open the chat window.
de: Tastenkombination zum Öffnen des Chat-Fensters.

source: Weather Location Latitude
de: Wetterstandort Breitengrad

source: Latitude coordinate for weather queries (default: Berlin).
de: Breitengrad-Koordinate für Wetterabfragen (Standard: Berlin).

source: Weather Location Longitude
de: Wetterstandort Längengrad

source: Longitude coordinate for weather queries (default: Berlin).
de: Längengrad-Koordinate für Wetterabfragen (Standard: Berlin).
